[
  {
    "Id": 1,
    "jobId": 1,
    "jobSeekerId": 1,
    "jobTitle": "Senior Full Stack Developer",
    "companyName": "TechCorp Solutions",
    "location": "San Francisco, CA",
    "coverLetter": "I am excited to apply for the Senior Full Stack Developer position at TechCorp Solutions. With over 5 years of experience in full-stack development using React, Node.js, and cloud technologies, I believe I would be a valuable addition to your team. My experience leading development projects and working with agile methodologies aligns perfectly with your requirements.",
    "appliedDate": "2024-03-11T10:15:00Z",
    "status": "shortlisted",
    "employerNotes": "Strong technical background, good communication skills. Scheduled for technical interview."
  },
  {
    "Id": 2,
    "jobId": 2,
    "jobSeekerId": 4,
    "jobTitle": "Frontend React Developer",
    "companyName": "InnovateTech",
    "location": "Seattle, WA",
    "coverLetter": "I am very interested in the Frontend React Developer role at InnovateTech. My 3 years of React experience, combined with my TypeScript and state management expertise, make me an ideal candidate for this position. I'm passionate about creating intuitive user interfaces and would love to contribute to your AI-powered applications.",
    "appliedDate": "2024-03-12T14:30:00Z",
    "status": "applied",
    "employerNotes": ""
  },
  {
    "Id": 3,
    "jobId": 3,
    "jobSeekerId": 8,
    "jobTitle": "Product Manager",
    "companyName": "GlobalCorp Industries",
    "location": "Austin, TX",
    "coverLetter": "With 7 years of project management experience and a strong background in agile methodologies, I am confident I can excel as a Product Manager at GlobalCorp Industries. My experience leading cross-functional teams and delivering complex projects aligns well with your digital transformation initiatives.",
    "appliedDate": "2024-03-09T09:45:00Z",
    "status": "reviewed",
    "employerNotes": "Good project management experience, needs to demonstrate product strategy skills."
  },
  {
    "Id": 4,
    "jobId": 4,
    "jobSeekerId": 6,
    "jobTitle": "UX/UI Designer",
    "companyName": "TechCorp Solutions",
    "location": "New York, NY",
    "coverLetter": "I am thrilled to apply for the UX/UI Designer position at TechCorp Solutions. My 4 years of product design experience, proficiency in Figma and Adobe Creative Suite, and my passion for creating user-centered designs make me a perfect fit for your team. I have successfully led design systems initiatives and collaborated effectively with engineering teams.",
    "appliedDate": "2024-03-14T16:20:00Z",
    "status": "applied",
    "employerNotes": ""
  },
  {
    "Id": 5,
    "jobId": 1,
    "jobSeekerId": 4,
    "jobTitle": "Senior Full Stack Developer",
    "companyName": "TechCorp Solutions",
    "location": "San Francisco, CA",
    "coverLetter": "Although I have 3 years of experience primarily in frontend development, I am eager to expand into full-stack development. My strong React and TypeScript skills, combined with my willingness to learn Node.js and cloud technologies, make me a motivated candidate for this senior position.",
    "appliedDate": "2024-03-13T11:00:00Z",
    "status": "rejected",
    "employerNotes": "Good frontend skills but lacks the required backend and senior-level experience."
  },
  {
    "Id": 6,
    "jobId": 5,
    "jobSeekerId": 1,
    "jobTitle": "DevOps Engineer",
    "companyName": "InnovateTech",
    "location": "Remote",
    "coverLetter": "While my primary background is in full-stack development, I have gained valuable experience with AWS, Docker, and CI/CD pipelines in my current role. I am passionate about infrastructure and would love to transition into a dedicated DevOps role at InnovateTech.",
    "appliedDate": "2024-03-12T08:30:00Z",
    "status": "applied",
    "employerNotes": ""
  },
  {
    "Id": 7,
    "jobId": 7,
    "jobSeekerId": 4,
    "jobTitle": "Junior Software Developer",
    "companyName": "TechCorp Solutions",
    "location": "Boston, MA",
    "coverLetter": "I am interested in the Junior Software Developer position at TechCorp Solutions. Although I have 3 years of experience, I am attracted to your mentorship program and the opportunity to work in a collaborative learning environment while contributing to meaningful projects.",
    "appliedDate": "2024-03-13T17:45:00Z",
    "status": "hired",
    "employerNotes": "Overqualified but excellent attitude and cultural fit. Hired for junior role with accelerated growth path."
  }
]