[
  {
    "Id": 1,
    "employerId": 2,
    "companyName": "TechCorp Solutions",
    "title": "Senior Full Stack Developer",
    "description": "We are looking for an experienced Full Stack Developer to join our growing team. You'll work on cutting-edge web applications using React, Node.js, and cloud technologies. This role offers excellent growth opportunities and the chance to work on innovative projects that impact thousands of users.",
    "requirements": "5+ years of experience with JavaScript, React, and Node.js. Experience with AWS, Docker, and agile development practices. Strong problem-solving skills and ability to work in a collaborative environment.",
    "location": "San Francisco, CA",
    "salaryMin": 120000,
    "salaryMax": 160000,
    "jobType": "full-time",
    "experienceLevel": "senior",
    "postedDate": "2024-03-10T09:00:00Z",
    "deadline": "2024-04-10T23:59:59Z",
    "status": "active"
  },
  {
    "Id": 2,
    "employerId": 5,
    "companyName": "InnovateTech",
    "title": "Frontend React Developer",
    "description": "Join our dynamic team as a Frontend Developer working on next-generation AI-powered applications. You'll be responsible for creating intuitive user interfaces and ensuring excellent user experiences across our product suite.",
    "requirements": "3+ years of React experience, proficiency in TypeScript, experience with state management libraries (Redux/Zustand), knowledge of modern CSS and responsive design principles.",
    "location": "Seattle, WA",
    "salaryMin": 90000,
    "salaryMax": 120000,
    "jobType": "full-time",
    "experienceLevel": "mid",
    "postedDate": "2024-03-12T10:30:00Z",
    "deadline": "2024-04-12T23:59:59Z",
    "status": "active"
  },
  {
    "Id": 3,
    "employerId": 7,
    "companyName": "GlobalCorp Industries",
    "title": "Product Manager",
    "description": "Lead product strategy and development for our digital transformation initiatives. Work closely with engineering, design, and business teams to deliver products that drive business value and customer satisfaction.",
    "requirements": "5+ years of product management experience, preferably in B2B software. Strong analytical skills, experience with agile methodologies, and excellent communication abilities.",
    "location": "Austin, TX",
    "salaryMin": 130000,
    "salaryMax": 170000,
    "jobType": "full-time",
    "experienceLevel": "senior",
    "postedDate": "2024-03-08T14:15:00Z",
    "deadline": "2024-04-15T23:59:59Z",
    "status": "active"
  },
  {
    "Id": 4,
    "employerId": 2,
    "companyName": "TechCorp Solutions",
    "title": "UX/UI Designer",
    "description": "Create beautiful and functional user experiences for our enterprise software solutions. Collaborate with product and engineering teams to design intuitive interfaces that solve complex business problems.",
    "requirements": "4+ years of UX/UI design experience, proficiency in Figma and Adobe Creative Suite, experience with design systems, user research, and usability testing.",
    "location": "New York, NY",
    "salaryMin": 85000,
    "salaryMax": 115000,
    "jobType": "full-time",
    "experienceLevel": "mid",
    "postedDate": "2024-03-14T11:00:00Z",
    "deadline": "2024-04-20T23:59:59Z",
    "status": "active"
  },
  {
    "Id": 5,
    "employerId": 5,
    "companyName": "InnovateTech",
    "title": "DevOps Engineer",
    "description": "Build and maintain our cloud infrastructure and deployment pipelines. Help scale our systems to handle growing user demand while maintaining high reliability and security standards.",
    "requirements": "3+ years of DevOps experience, expertise in AWS/GCP, Docker, Kubernetes, CI/CD pipelines, and infrastructure as code (Terraform/CloudFormation).",
    "location": "Remote",
    "salaryMin": 100000,
    "salaryMax": 140000,
    "jobType": "full-time",
    "experienceLevel": "mid",
    "postedDate": "2024-03-11T16:45:00Z",
    "deadline": "2024-04-25T23:59:59Z",
    "status": "active"
  },
  {
    "Id": 6,
    "employerId": 7,
    "companyName": "GlobalCorp Industries",
    "title": "Data Scientist",
    "description": "Apply machine learning and statistical analysis to solve complex business problems. Work with large datasets to derive insights that drive strategic decision-making across the organization.",
    "requirements": "PhD or Master's in Data Science, Statistics, or related field. 4+ years of experience with Python, R, SQL, and machine learning frameworks. Experience with big data technologies preferred.",
    "location": "Chicago, IL",
    "salaryMin": 110000,
    "salaryMax": 150000,
    "jobType": "full-time",
    "experienceLevel": "senior",
    "postedDate": "2024-03-09T13:20:00Z",
    "deadline": "2024-04-30T23:59:59Z",
    "status": "active"
  },
  {
    "Id": 7,
    "employerId": 2,
    "companyName": "TechCorp Solutions",
    "title": "Junior Software Developer",
    "description": "Start your career in software development with our mentorship-focused program. Work on real projects while learning from experienced developers in a supportive environment.",
    "requirements": "Bachelor's degree in Computer Science or related field, basic knowledge of JavaScript, HTML, CSS, and either React or Angular. Internship or project experience preferred.",
    "location": "Boston, MA",
    "salaryMin": 70000,
    "salaryMax": 85000,
    "jobType": "full-time",
    "experienceLevel": "entry",
    "postedDate": "2024-03-13T09:30:00Z",
    "deadline": "2024-05-01T23:59:59Z",
    "status": "active"
  },
  {
    "Id": 8,
    "employerId": 5,
    "companyName": "InnovateTech",
    "title": "Marketing Manager",
    "description": "Lead our digital marketing initiatives and help grow our brand presence in the AI/ML space. Develop and execute marketing campaigns that drive lead generation and customer acquisition.",
    "requirements": "5+ years of B2B marketing experience, preferably in technology sector. Experience with digital marketing, content creation, marketing automation, and analytics.",
    "location": "Los Angeles, CA",
    "salaryMin": 95000,
    "salaryMax": 125000,
    "jobType": "full-time",
    "experienceLevel": "mid",
    "postedDate": "2024-03-07T15:10:00Z",
    "deadline": "2024-04-07T23:59:59Z",
    "status": "active"
  }
]